[{"id":"1798","title":"KFS Basics","date":"18-May-2014","starttime":"8:30 AM","endtime":"12:00 PM","room":"Grande Ballroom B","track":"Kuali Financial System (KFS)","level":"Beginner","types":["Functional"],"presenters":[{"name":"Lyons, David","title":"KFS Liaison","bio":"[removed]"},{"name":"Dorsey, Damon ","title":"Financial Systems Coordinator","bio":"[removed]"},{"name":"Overman, William","title":"Manager, Financial Management Services","bio":"[removed]"},{"name":"Rawleigh, Nicole ","title":"Security and Workflow Analyst","bio":"[removed]"},{"name":"Schimizzi, Vincent ","title":"Senior Management Analyst","bio":"[removed]"}],"details":"This pre-conference session will give an overview of the Kuali Financial System core programs and features including: Kuali portal, chart of accounts, general ledger, electronic transaction processing documents (e-docs) Kuali Enterprise Workflow (KEW) and Kuali Identity Management (KIM). The key features of each module will be reviewed including the newest ones and those scheduled for release in the near future. There will be a live demo and an opportunity to ask questions. Participants will gain an understanding of KFS core functions and features, an understanding of each of the available modules and examples of how the flexibility in KFS can be configured to support different business processes at colleges and universities."},{"id":"1958","title":"Introduction to Kuali Student Curriculum Management Configuration","date":"18-May-2014","starttime":"8:30 AM","endtime":"12:00 PM","room":"Harbor 3","track":"Kuali Student (KS)","level":"Beginner","types":["Technical","Implementation"],"presenters":[{"name":"Mann, Chris","title":"Curriculum Management Implementation Lead","bio":"[removed]"},{"name":"Komandur, Sri","title":"Service Architect","bio":"[removed]"},{"name":"Wright, Norm","title":"Service Architect","bio":"[removed]"}],"details":"Kuali Student's Curriculum Management System is designed to be highly configurable to meet the needs of a wide range of implementing institutions.\r\nThis hands-on half-day workshop provides attendees with a basic understanding of major mechanisms for configuration then works with each attendee to setup on their machine their own overlay project that they can then use to begin to configure Kuali Student to meet their own school's needs. Attendees are expected to bring their own computer already configured to run the downloadable instance of Kuali Student Curriculum Management 2.0. \r\n\r\nAttendees of this session should also attend the corresponding afternoon session which shows examples of different configuration techniques."},{"id":"1861","title":"Scrum in the Real World: Half Day Simulation","date":"18-May-2014","starttime":"8:30 AM","endtime":"12:00 PM","room":"Grande Ballroom A","track":"General Topics","level":"All","types":["Implementation","Functional"],"presenters":[{"name":"Vizdos, Michael ","title":"Managing Director","bio":"[removed]"}],"details":"Scrum and Agile is being discussed at all levels within KUALI. \r\n\r\nWhat is it? Really?\r\n\r\nInstead of just being buzz-word compliant, come spend some time learning about the basics of Scrum.\r\n\r\nThen, using our basic understand of the framework, we'll actually DO a project. While this is only a simulation, you'll have a great understanding of what a Scrum project is really set up to deliver to your end users.\r\n\r\nSomething that is DONE.\r\n\r\nThe output of the actual simulation will have *nothing* to do with the real world.\r\n\r\nAnd.\r\n\r\nYou'll actually walk away with a solid understanding of the Scrum framework and actually see what it is like to prioritize a Product Backlog, create a Sprint Backlog, break it into a Sprint with multiple \"days\", work as a team, and conduct a daily \"Stand-up\", and demonstrate a DONE product at the end.\r\n\r\nThen, we'll have a Sprint Retrospective and discuss the REAL WORLD implications.\r\n\r\nAll levels of experience are encouraged and everyone will learn (and have a bit of fun)."},{"id":"1813","title":"Kuali Coeus Community - Overview","date":"18-May-2014","starttime":"8:30 AM","endtime":"12:00 PM","room":"Harbor 1","track":"Kuali Coeus (KC)","level":"Beginner","types":["Technical","Functional"],"presenters":[{"name":"Schultz, Lori","title":"Assistant Director, Sponsored Projects Services ","bio":"[removed]"},{"name":"Athreya, Gayathri","title":"Kuali Coeus Technical Lead and Kuali Rice Liaison, UITS","bio":"[removed]"},{"name":"Mazzeo Leslie, Colleen","title":"Associate Director, OSP ","bio":"[removed]"}],"details":"The Kuali Coeus Community (KCC) has been created to guarantee the sustainability of the open source software product and provide a mechanism for participating institutions to invest in the continued improvement of the modules. The KCC sustainability model includes two levels of participation, subcommittees focused on individual modules and representation in various Kuali Rice and Foundation activities. Investing partners ensure a healthy and continually improving product. They gain influence in defining product enhancements and build strong working relationship with other implementing institutions. This session will describe the Kuali Coeus Community, its operating procedures, the benefits of joining and a technical overview."},{"id":"2013","title":"KPME Time & Leave Management Quick Start ","date":"18-May-2014","starttime":"8:30 AM","endtime":"12:00 PM","room":"Nautilus 1","track":"Kuali People Management for the Enterprise","level":"Intermediate","types":["Functional"],"presenters":[{"name":"Balmer, Mindi","title":"Business Analyst","bio":"[removed]"},{"name":"Hanson, Jeremy","title":"KPME Lead Architect","bio":"[removed]"},{"name":"Merkel, Dirk","title":"CTO","bio":"[removed]"}],"details":"This preconference session will consist of a comprehensive review of the implementation or a proof of concept strategy for KPME 2.0: Time and Leave, which may be used at your institution. It will include an in-depth functional overview of the setup tables, delivered functionality and data structure. The presenters will conduct a live demonstration of the system as well as demonstrate how KPME can be quickly launched in the cloud and data loaded through an upload tool. The presenters will also install the accompanying mobile app, which will then be used to clock in and out of the newly launched KME instance. Each participant will receive their own private instance to work with during the interactive demonstration, which will remain active for 30 days after. During the preconference session, attendees will have access to the KPME implementation experts to ask questions and benefit from their recent implementation experiences."},{"id":"1841","title":"Kuali Workflow and Identity Management Workshow","date":"18-May-2014","starttime":"8:30 AM","endtime":"12:00 PM","room":"Grande Ballroom C","track":"Kuali Rice","level":"Intermediate","types":["Technical"],"presenters":[{"name":"Taylor, Martin","title":"Software Developer","bio":"[removed]"},{"name":"Gomes, Wil","title":"Software Developer","bio":"[removed]"},{"name":"Keller, Jonathan","title":"Software Developer","bio":"[removed]"},{"name":"Nieson, Claus","title":"Software Lead","bio":"[removed]"}],"details":"Looking to make more use of Kuali Rice in your client applications? This workshop will help two facets of Rice, the enterprise workflow and identity management components. This hands-on workshop will cover adding roles, groups and related services into a sample application. You will add functionality by setting up a document workflow and actions. The end result will be a better understanding of how you can leverage the features of rice to build better apps.\r\n\r\nPrerequisites: Understanding of Java, XML, Spring, and using a Java IDE."},{"id":"1814","title":"Kuali Coeus Compliance Modules Lifecyle and Overview ","date":"18-May-2014","starttime":"8:30 AM","endtime":"12:00 PM","room":"Exec Center 1","track":"Kuali Coeus (KC)","level":"Beginner","types":["Functional"],"presenters":[{"name":"Sung, Weiwen","title":"Programmer\/Analyst, Information Technology Services ","bio":"[removed]"},{"name":"Abraham, Joseph","title":"Business Analyst","bio":"[removed]"},{"name":"Hollander, Melinda","title":"\tAnimal Compliance and Training Officer ","bio":"[removed]"},{"name":"King, Claire","title":"\tManager, ERA Systems and Financial Reporting ","bio":"[removed]"}],"details":"This presentation will include information on the three Kuali Coeus Compliance Modules:\r\n\r\nIACUC - This session will demonstrate the life-cycle of an IACUC protocol. Presenters will play the role of researcher, reviewer and an IACUC administrator to cover protocol submission, IACUC pre-review, review type determination, designated\/full committee review and final approval of the protocol. Special attention will be given to showing how the KC IACUC species, procedures and exceptions screens are designed. In addition, the process of making minor or major revisions, amending, renewing and continuing an IACUC protocol will also be shown.\r\n\r\nIRB - The IRB session will provide a general overview of the IRB module followed by a closer look into newer functionality for IRB such as notifications, watermarking, online review and enhancements made to the IRB module post functional equivalency. The session will also cover some of the areas within the IRB application where future enhancements can be expected.\r\n\r\nCOI - The session will provide a brief overview of the Kuali Coeus COI application. The following features will be shown - creation and maintenance of financial entities, disclosures triggered by events such as proposal, protocols etc, annual disclosures, look-ups for administrators, reviewer functionality and how to trigger different disclosure forms using the Kuali Rule Management System (KRMS).\r\n"},{"id":"1764","title":"Bootcamp for Functional Implementers","date":"18-May-2014","starttime":"8:30 AM","endtime":"12:00 PM","room":"Harbor 2","track":"Kuali Student (KS)","level":"All","types":["Implementation"],"presenters":[{"name":"Appel, Michelle","title":"UMD","bio":"[removed]"},{"name":"Colson, Michael","title":"Senior Programmer, Academic Affairs","bio":"[removed]"},{"name":"Howard, Erin","title":"Academic Affairs","bio":"[removed]"}],"details":"This workshop will provide a framework for functional implementation team members. Topics will include: team structure, strategies for balancing functional priorities and managing scope, suggestions for maximizing limited time and resources, and creative approaches to testing and data entry\/migration. Members of the Maryland implementation team will discuss how a team comprised of part-time resources leveraged experience in a variety of functional areas to implement KS and how these lessons can be applied to other institutions."},{"id":"1791","title":"Installfest: Computer Setup for Rice Application Development","date":"18-May-2014","starttime":"1:00 PM","endtime":"4:30 PM","room":"Grande Ballroom C","track":"Kuali Rice","level":"Beginner","types":["Technical"],"presenters":[{"name":"Niesen, Claus","title":"Systems Analyst","bio":"[removed]"},{"name":"Manning, Steve","title":"Programmer Analyst","bio":"[removed]"},{"name":"Meade, Erik","title":"Kuali Rice Developer","bio":"[removed]"}],"details":"This workshop will get attendees set up and ready to do development of Rice applications on the laptops they bring with them. We will be installing and configuring Java Developer Kit, Maven, Eclipse, and MySQL. Our focus will be on Windows and OS-X."},{"id":"1869","title":"The Supported Projects Lifecycle: A demo from proposal generation to award close-out ","date":"18-May-2014","starttime":"1:00 PM","endtime":"4:30 PM","room":"Exec Center 1","track":"Kuali Coeus (KC)","level":"Beginner","types":["Functional"],"presenters":[{"name":"Sorensen, Susan","title":"eRA Specialist","bio":"[removed]"},{"name":"Mundt, Susan","title":"Principal Sponsored Projects Administrator","bio":"[removed]"},{"name":"Peck, Jessica","title":"Principal Sponsored Projects Administrator","bio":"[removed]"}],"details":"This session will demonstrate the life-cycle of proposal, institutional proposal, and award from creation to close-out. Presenters will walk through a proposal which has been already created route, approve and submit the proposal to a sponsor, and follow that proposal through the application process as it becomes approved for funding. Presenters will play various roles including PI and administrators. This session will also cover some of the areas within the preaward and award modules where future enhancements are expected."},{"id":"1760","title":"Advanced Configuration Kuali Student Curriculum Management","date":"18-May-2014","starttime":"1:00 PM","endtime":"4:30 PM","room":"Harbor 3","track":"Kuali Student (KS)","level":"Intermediate","types":["Technical","Implementation"],"presenters":[{"name":"Mann, Chris","title":"Curriculum Management Implementation Lead","bio":"[removed]"},{"name":"Komandur, Sri","title":"Service Architect","bio":"[removed]"}],"details":"Kuali Student's Curriculum Management System is designed to be highly configurable to meet the needs of a wide range of implementing institutions. This hands-on half-day advanced workshop leads developers through a variety of hands-on configuration examples. These range from simple changes to the dictionary to more complex changes to the user interface and service.\r\n\r\nAttendees of this session are expected to have attended the corresponding morning session so that they understand the basic mechanisms for configuration as well has have their basic overlay project set up on their machine.\r\n\r\nAttendees are expected to bring their own computer already configured with their own overlay project setup within which they can make their own example changes. "},{"id":"1878","title":"Using Kuali Infrastructure and Tools","date":"18-May-2014","starttime":"1:00 PM","endtime":"4:30 PM","room":"Grande Ballroom A","track":"General Topics","level":"Beginner","types":["Technical"],"presenters":[{"name":"Sadiq, Farooq","title":"Director of Infrastructure","bio":"[removed]"},{"name":"Patterson, Shem","title":"Technical Support Systems Specialist","bio":"[removed]"}],"details":"This session will allow attendees to learn about Kuali Infrastructure Tools used by the community, and see demonstrations of what a new participant needs to get setup and in a Kuali Project. Attendees will also learn tricks and tips as we demonstrate particular communication tools. A tentative outline of specific topics discussed include: Getting setup on Kuali Infrastructure Using Skype , Adobe Connect and other communication tools Using Jira and Confluence Using Kuali Google Apps An brief introduction to the development tools Subversion, Fisheye, Crucible."},{"id":"2012","title":"MySQL --The Most Popular Web Database Base","date":"18-May-2014","starttime":"1:00 PM","endtime":"4:30 PM","room":"Nautilus 1","track":"General Topics","level":"All","types":["Technical"],"presenters":[{"name":"Stokes, David","title":"MySQL Community Manager","bio":"[removed]"}],"details":"MySQL is an Open Source Database (pronounced FREE) has over 17,000,000 installations and runs everything from your Cisco router to Facebook, Twitter, and more. Learn how this popular relational database has grown into an enterprise ready software that powers everything from small Content Management Systems (Joomla, Drupal, Wordpress, SugarCRM) to large web presences and into the cloud (Amazon, HP). This session will cover recent advancements such as NoSQL access, sharding improvements, automatic replication & server fail-over, and the developmental road map."},{"id":"1957","title":"Kuali Student Curriculum Management Configuration- Key Decisions and Real World Data Loading","date":"18-May-2014","starttime":"1:00 PM","endtime":"4:30 PM","room":"Harbor 2","track":"Kuali Student (KS)","level":"Beginner","types":["Implementation"],"presenters":[{"name":"Wright, Norm","title":"Service Architect","bio":"[removed]"},{"name":"McClellan, David","title":"Sr. Application System Eng.","bio":"[removed]"}],"details":"Kuali Student's Curriculum Management System is designed to be highly configurable to meet the needs of a wide range of implementing institutions. This hands-on workshop leads architects, team leads and technical BAs through a series of exercises to help them make the best decisions for their institution. These exercises will include working through decision matrices to help them map out the best approach for them to load data, configure workflow and manage authorization. It will discuss UW's logic and specific code needed to utilize various Curriculum Management 2.0 webs services to load and maintain data typically originating from external systems. It will discuss specific java code (and pseudo-code for non-java developers) to use the services to create the complex set of foreign keys required by the database schema. Adding new course versions requires the most complex choreography and will be discussed in the most detail. Adding ATPs will also be covered. Attendees will leave with an understanding of the types of questions and key decisions their school will have to go through as they implement Kuali Student Curriculum Management.\r\n\r\nTeam Leads and architects who are also developers who take this session may also wish to attend the morning session so they also understand the basics of configuration."},{"id":"1765","title":"Building the Case for Kuali","date":"18-May-2014","starttime":"1:00 PM","endtime":"4:30 PM","room":"Harbor 1","track":"General Topics","level":"Beginner","types":["Implementation"],"presenters":[{"name":"Potts, Anthony","title":"CTO","bio":"[removed]"},{"name":"Denna, Eric","title":"CIO","bio":"[removed]"},{"name":"Farley, John","title":"Associate Vice President","bio":"[removed]"},{"name":"Hope, Maury","title":"Associate CIO","bio":"[removed]"},{"name":"Johnson, Lynn","title":"Associate Vice President for Finance","bio":"[removed]"},{"name":"Walsh, Barry","title":"Strategic Consultant","bio":"[removed]"},{"name":"Warren, Sean","title":"Product Manager","bio":"[removed]"},{"name":"Wheeler, Brad","title":"VP for IT & CIO","bio":"[removed]"},{"name":"Yock, Bill","title":"Director, Enterprise Information Services","bio":"[removed]"}],"details":"Often a single champion or small group on campus sees the possibilities for Kuali. This workshop will assist the champion in creating the case for Kuali that can be used to build broader understanding and support across campus. During this session, you will meet with champions from schools that have already implemented Kuali products; hear how they built consensus in their schools, led the projects to completion, obtained funding, and more! \r\n\r\nThe session will be very informal, and organized as an overview from each of the representative schools with Q&A throughout."},{"id":"2004","title":"Kuali Overview for Newcomers","date":"18-May-2014","starttime":"4:30 PM","endtime":"5:15 PM","room":"Nautilus 5","track":"General Topics","level":"Beginner","types":["Implementation","Functional","Technical"],"presenters":[{"name":"Christen, Sarah","title":"Assistant Director of Community Applications","bio":"[removed]"}],"details":"If you?re new to Kuali, this session is a chance to get a quick overview of each of the Kuali Applications. Held in the Speed Geeking session format, we will have experts on each application ready with a quick overview and prepared to answer your questions. If you are wondering what Kuali has to offer in terms of applications, this is your opportunity to see it all at once."},{"id":"235","title":"REGISTRATION DESK OPEN","date":"18-May-2014","starttime":"7:30 AM","endtime":"7:00 PM","room":"Harbor Island Foyer","track":"Unknown","level":"Unknown","types":["Event"],"presenters":[],"details":""},{"id":"231","title":"Welcome Reception - Sponsored by Moderas","date":"18-May-2014","starttime":"5:30 PM","endtime":"7:00 PM","room":"Bayview Lawn","track":"Unknown","level":"Unknown","types":["Event"],"presenters":[],"details":""}]